{
  "margaritas": [
    {
      "id": 1,
      "name": "Classic Margarita",
      "ingredients": [
        "1 oz silver tequila",
        "1 oz Cointreu",
        "1/2 oz fresh lime juice",
        "coarse salt and a slice of lime for garnish"
      ],
      "directions": "Combine the tequila, cointreau, lime juice and simple syrup in an ice-filled cocktail shaker. Shake until cold, and strain into a chilled, salt-rimmed rocks glass. Garnish with lime, and serve.",
      "image": "https://bit.ly/3IEwvOv",
      "favorite": true
    },
    {
      "id": 2,
      "name": "Blue Margarita",
      "ingredients": [
        "1 1/2 oz silver tequila",
        "1 oz Blue Curacao",
        "1 oz fresh lime juice",
        "coarse salt and a slice of lime for garnish"
      ],
      "directions": "Combine the tequila, Blue Curacao and lime juice in an ice-filled cocktail shaker. Shake until cold, and strain into a chilled, salt-rimmed rocks glass. Garnish with lime, and serve.",
      "image": "https://bit.ly/346J3Pu",
      "favorite": false
    },
    {
      "id": 3,
      "name": "Strawberry Margarita",
      "ingredients": [
        "1 oz silver tequila",
        "1/2 oz Strawberry Schnaps",
        "1/2 oz Triple Sec",
        "1/2 oz fresh lemon juice",
        "1 oz chopped strawberries",
        "coarse salt and a fresh strawberry for garnish"
      ],
      "directions": "Combine the tequila, Triple Sec, Strawberry Schnaps, lemon juice and strawberries in an ice-filled cocktail shaker. Shake until cold, and strain into a chilled, salt-rimmed rocks glass. Garnish a strawberry, and serve.",
      "image": "https://bit.ly/3vR5tQn",
      "favorite": false
    },
    {
      "id": 4,
      "name": "Smashed Watermelon Margarita",
      "ingredients": [
        "1 1/2 oz silver tequila",
        "2 1/2 oz Grapefruit Juice",
        "1/2 cup watermelon",
        "juice of 1/2 lime",
        "5 mint leaves",
        "coarse salt and a slice of watermelon for garnish"
      ],
      "directions": "In a mason jar muddle the watermelon and 5 mint leaves together into a puree and strain. Next add the grapefruit juice, juice of half a lime and the tequila as well as some ice. Put a lid on the jar and shake. Pour into a glass and add more ice. Garnish with fresh mint and a small slice of watermelon.",
      "image": "bit.ly/3Kh37Oq",
      "favorite": true
    },
    {
      "id": 5,
      "name": "Cucumber Jalapeño Margarita",
      "ingredients": [
        "2 oz silver tequila",
        "1 oz Cointreau",
        "1 oz fresh lime juice",
        "3 slices jalapeõ",
        "8 slices cucumber",
        "2 tbs granulated sugar",
        "coarse salt and slices of lime for garnish"
      ],
      "directions": "In a cocktail shaker, add cucumber slices, lime slices, lime juice, jalapeno slices, and sugar and muddle together. Add tequila and Cointreau and fill with ice. Shake until cold, and strain into a chilled, salt-rimmed rocks glass. Garnish with cucumber and serve.",
      "image": "https://bit.ly/347V1bL",
      "favorite": true
    },
    {
      "id": 6,
      "name": "Mango Margarita",
      "ingredients": [
        "3 oz silver tequila",
        "1 oz Cointreau",
        "1 oz fresh lime juice",
        "1 1/2 cups diced frozen mango pieces",
        "1 tbs simple syrup",
        "coarse salt and a slice of lime for garnish"
      ],
      "directions": "Add the tequila, Cointreau, lime juice, frozen mango, simple syrup and ice to a blender. Blend until frothy and fully combined strain into a chilled, salt-rimmed rocks glass. Garnish with lime, and serve.",
      "image": "https://bit.ly/3vFXS6S",
      "favorite": true
    },
    {
      "id": 7,
      "name": "Basil Lime Margarita",
      "ingredients": [
        "2 oz silver tequila",
        "1 oz fresh lime juice",
        "1 oz simple syrup",
        "4 basil leaves",
        "coarse salt and a slice of lime for garnish"
      ],
      "directions": "Combine the tequila, lime juice, simple syrup and basil leaves in an ice-filled cocktail shaker. Shake until cold, and strain into a chilled, salt-rimmed rocks glass. Garnish with lime, basil leaves, and serve.",
      "image": "https://bit.ly/3HvAZpj",
      "favorite": false
    },
    {
      "id": 8,
      "name": "Ginger Margarita",
      "ingredients": [
        "2 oz silver tequila",
        "1 oz lime juice",
        "1 oz Honey Syrup",
        "3 slices of fresh ginger",
        "coarse salt and sliced lime ginger for garnish"
      ],
      "directions": "To make Honey syrup, combine equal parts of honey and warm water, stirring until honey dissolves. Muddle the 2 ginger slices with the honey syrup in a coctail shaker. Add the tequila, lime juice and ice. Shake until cold, then strain into a chilled, salt-rimmed rocks glass. Garnish with lime a slice of ginger, and serve.",
      "image": "https://bit.ly/3pyXlA5",
      "favorite": false
    },
    {
      "id": 9,
      "name": "Spicy Jalapeño Margarita",
      "ingredients": [
        "2 oz silver tequila",
        "1 oz lime juice",
        "1 oz Jalapeño Simple Syrup",
        "coarse salt and fresh sliced jalapeño and lime for garnish"
      ],
      "directions": "To make Jalapeño Simple Syrup by combe 1/2 cup of water and 1/2 cup of sugar with 1 sliced jalapeño in a small pot. Bring to a boil and set aside to cool. When cool add, to a coctail shaker with ice along wiht the teqila and lime juice. Shake until cold, then strain into a salt-rimmed coctail glass. Garnish with fresh slices of lime and jalapeño. ",
      "image": "https://bit.ly/3hVOZ0Y",
      "favorite": false
    },
    {
      "id": 10,
      "name": "Peach Margarita",
      "ingredients": [
        "2 oz silver tequila",
        "1 oz lime juice",
        "2 oz Peach Schnapps",
        "1 medium ripe to over-ripe peach",
        "coarse salt and fresh sliced peach and lime for garnish"
      ],
      "directions": "Peel and dice peach, muddle in a coctail shaker. Add the tequila, lime juice, peach schnapps and ice, shake until cool. When cool add, to a coctail shaker with ice along wiht the teqila and lime juice. Shake until cold, then strain into a salt-rimmed coctail glass. Garnish with fresh slices of lime and peach.  ",
      "image": "https://bit.ly/3pRjgSW",
      "favorite": false
    },
    {
      "id": 11,
      "name": "Grapefruit Margarita",
      "ingredients": [
        "1 1/2 oz silver tequila",
        "1 oz Triple Sec",
        "1 oz Ruby Red Grapefruit Juice",
        "1 teaspoon Grenadine Syrup",
        "coarse salt and fresh sliced grapefruit for garnish"
      ],
      "directions": "Combine the tequila, Triple Sec, grapefruit juice and Grenadine syrup in an ice-filled cocktail shaker. Shake until cold, and strain into a salt-rimmed glass. Garnish with a slice of fresh grapefruit and serve.",
      "image": "https://bit.ly/3pRVTJ9",
      "favorite": true
    },
    {
      "name": "Golden Margarita",
      "ingredients": [
        "1 1/2 oz gold tequila",
        "1 oz Cointreau",
        "1 oz lime juice",
        "1 oz sour mix",
        "1 dash orange juice",
        "coarse salt and a lime wedge"
      ],
      "directions": "In a cocktail shaker filled with ice, pour the tequila, orange liqueur, lime juice, and sour mix. Add a splash of orange juice if you prefer. Shake well and strain into a salt rimmed glass, garnish with a lime wedge and serve. ",
      "image": "https://bit.ly/3I6qWXX",
      "favorite": false,
      "id": 12
    },
    {
      "name": "Rosemary Margarita",
      "ingredients": [
        "1 1/2 oz silver tequila",
        "1/2 oz Triple Sec",
        "1 oz rosemary simple syrup",
        "2 oz lime juice",
        "2 oz lemon juice ",
        "coarse sugar, rosemary and a slice of lime for garnish"
      ],
      "directions": "Firs make rosemary simple syrup by bringing 1 cup of water, 1 cup of sugar and 2 rosemary sprig to a boil. Stir until sugar has completely dissolved. Let cool. Fill a coctail shaker with ice and add all ingredients. Shake well and pour over a sugar rimmed glass and garnish with a sprig of rosemary and a slice of lime.  ",
      "image": "https://bit.ly/3I5X6CK",
      "favorite": false,
      "id": 13
    },
    {
      "name": "Champagne Margarita",
      "ingredients": [
        "1 1/2 oz silver tequila",
        "1 oz lime juice",
        "1/2 oz simple syrup",
        "1 dash of Cointreu",
        "dry champagne or sparkling wine to top",
        "coarse salt and a lime wedge"
      ],
      "directions": "First make simple syrup: combine sugar and water in a small saucepan over medium-high heat and whisk to dissolve sugar. Bring to a boil then remove from heat and cool. Combine tequila, lime juice, simple syrup, and orange liqueur in a cocktail shaker with plenty of ice and shake vigorously. Pour over ice into salt rimmed glass and top with champagne. Garnish with a wedge of lime. ",
      "image": "https://bit.ly/3tLdiV0",
      "favorite": false,
      "id": 14
    },
    {
      "name": "Pink Lemonade Margartia",
      "ingredients": [
        "1 1/2 oz silver tequila",
        "1 oz freshly squeezed lemon juice",
        "1/2 oz Cointreau",
        "4 oz Raspberry Lemonade",
        "corse salt, lemon wedges, mint leaves and fresh raspberries for garnish"
      ],
      "directions": "Combine raspberry lemonade, tequila, lemon juice, and orange liqueur in an ice filled cocktail shaker.  Shake well for a few seconds to incorporate and chill. Pour into glass with ice, garnish with a lemon slice, raspberries, and mint leaves. ",
      "image": "https://bit.ly/3tLfbRA",
      "favorite": false,
      "id": 15
    }
  ]
}
